tutorials/shearStressDriven/precursor/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

 #include      "include/ABLConditions"

internalField   uniform $kInit;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    ground
    {
        type            kqRWallFunction;
        value           uniform $kInit;
    }

    top
    {
        type            fixedValue;
        value		uniform $topK;

        // An alternative if the height of the domain is sufficient
        //type            zeroGradient;
    }

    sides
    {
        type            empty;
    }

    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
